tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-fonts"

brew "antigen"
brew "bat"
brew "git"
brew "gnupg"
brew "neovim"
brew "python@3.9"
brew "stow"
brew "tmux"
brew "tree"
brew "fzf"

cask "alacritty"
cask "docker"
cask "firefox"
cask "microsoft-teams"
cask "notion", args: { appdir: "/Volumes/Mac SSD/Applications" }
cask "paw"
cask "intellij-idea"
cask "pycharm"
cask "webstorm"
cask "font-jetbrains-mono"
cask "spotify"
cask "visual-studio-code"

# Ruby
# Use [RVM](http://rvm.io/) instead of Homebrew.

# Node
# Use [`nvm`](https://github.com/creationix/nvm) instead of Homebrew.
# Install manually using git clone rather than the install script:
# https://github.com/creationix/nvm#manual-install

